<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Гра "Міста"</title>
</head>
<body>
    <form action="/form2.php" method="get">

    <h3>Гра "Міста"</h3>
    <div>Умови гри: у грі беруть участь людина та комп'ютер. Людина називає місто, далі отримує відповідь від комп'ютера, 
        де назва міста починається на останню літеру названого гравцем міста. Далі ситуація повторюється, гравець має назвати місто, 
        у якого назва починається з останньої літери названим оппонентом міста. У грі беруть участь лише назви українських міст,
        назви міст не можуть повторюватися. </div>


    <p>Введіть назву міста: 
        <input type="text" name="city" required/>
        </p>   
       
        <input type="submit" value="Грати" name="Грати">
    </form>
</body>
</html>
